---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarBarHookLengths
source: html/eaf2c802-3c12-2c3d-622d-1cb721ea198c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarBarHookLengths Property

"Hook Lengths"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarBarHookLengths { get; }
```